create_clock -name {FPGACK40} -period 25 -waveform {0 12.5 } -add  [ get_ports { FPGACK40_P } ]
create_clock -name {tx_clk0} -period 8 -waveform {0 4 } -add  [ get_nets { CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_0_TX_CLK } ]
create_clock -name {tx_clk2} -period 8 -waveform {0 4 } -add  [ get_nets { CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_2_TX_CLK } ]
create_clock -name {rx_clk0} -period 8 -waveform {0 4 } -add  [ get_nets { CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_0_RX_CLK } ]
create_clock -name {rx_clk2} -period 8 -waveform {0 4 } -add  [ get_nets { CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_2_RX_CLK } ]
create_clock -name {CLK_CONFIG_APB} -period 20 -waveform {0 10 } -add  [ get_nets { EPCS_Demo_INIT_APB_S_PCLK } ]
create_clock -name {DCLK0} -period 25 -waveform {0 12.5 } -add  [ get_ports { DCLK00_P } ]
# 80 MHz
set_input_delay 3 -min  -clock { DCLK0 } [ get_ports { DO_N } ]
set_input_delay 4 -max  -clock { DCLK0 } [ get_ports { DO_N } ]
set_input_delay 3 -min  -clock { DCLK0 } [ get_ports { DO_P } ]
set_input_delay 4 -max  -clock { DCLK0 } [ get_ports { DO_P } ]
# 40 MHz
set_input_delay 3 -min  -clock { DCLK0 } [ get_ports { GBTX_RXDVALID } ]
set_input_delay 4 -max  -clock { DCLK0 } [ get_ports { GBTX_RXDVALID } ]
set_input_delay 3 -min  -clock { DCLK0 } [ get_ports { GBTX_RXRDY } ]
set_input_delay 4 -max  -clock { DCLK0 } [ get_ports { GBTX_RXRDY } ]
set_input_delay 3 -min  -clock { DCLK0 } [ get_ports { GBTX_TXRDY } ]
set_input_delay 4 -max  -clock { DCLK0 } [ get_ports { GBTX_TXRDY } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { BERRB } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { BERRB } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { BUSYB } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { BUSYB } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { DTACKB } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { DTACKB } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { LTMLTB } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { LTMLTB } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { LWORDB } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { LWORDB } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { PXL_A } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { PXL_A } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { PXL_D } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { PXL_D } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { PXL_RD } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { PXL_RD } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { PXL_WR } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { PXL_WR } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { PXL_SDN } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { PXL_SDN } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { PXL_CS } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { PXL_CS } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { RAM_D } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { RAM_D } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { VAD } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { VAD } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { VDB } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { VDB } ]
set_output_delay 2 -min  -clock { DCLK0 } [ get_ports { DI_N } ]
set_output_delay 4 -max  -clock { DCLK0 } [ get_ports { DI_N } ]
set_output_delay 2 -min  -clock { DCLK0 } [ get_ports { DI_P } ]
set_output_delay 4 -max  -clock { DCLK0 } [ get_ports { DI_P } ]
set_output_delay 2 -min  -clock { DCLK0 } [ get_ports { GBTX_RESETB } ]
set_output_delay 3 -max  -clock { DCLK0 } [ get_ports { GBTX_RESETB } ]
set_output_delay 2 -min  -clock { FPGACK40 } [ get_ports { AML } ]
set_output_delay 4 -max  -clock { FPGACK40 } [ get_ports { AML } ]
set_output_delay 2 -min  -clock { FPGACK40 } [ get_ports { ASL } ]
set_output_delay 4 -max  -clock { FPGACK40 } [ get_ports { ASL } ]
set_false_path -from [ get_clocks { tx_clk0 } ] -to [ get_clocks { FPGACK40 } ]
set_false_path -from [ get_clocks { FPGACK40 } ] -to [ get_clocks { tx_clk0 } ]
set_false_path -from [ get_clocks { rx_clk0 } ] -to [ get_clocks { FPGACK40 } ]
set_false_path -from [ get_clocks { FPGACK40 } ] -to [ get_clocks { rx_clk0 } ]
set_clock_groups -name {default_clkgrp_0} -asynchronous -group [ get_clocks { tx_clk0 } ] -group [ get_clocks { FPGACK40 } ]
set_clock_groups -name {default_clkgrp_1} -asynchronous -group [ get_clocks { FPGACK40 } ] -group [ get_clocks { tx_clk0 } ]
set_clock_groups -name {default_clkgrp_2} -asynchronous -group [ get_clocks { rx_clk0 } ] -group [ get_clocks { FPGACK40 } ]
set_clock_groups -name {default_clkgrp_3} -asynchronous -group [ get_clocks { rx_clk0 } ] -group [ get_clocks { tx_clk0 } ]
set_clock_groups -name {default_clkgrp_4} -asynchronous -group [ get_clocks { FPGACK40 } ] -group [ get_clocks { DCLK0 } ]
