# Microsemi Corp.
# Date: 2023-Apr-13 16:20:02
# This file was generated based on the following SDC source files:
#   E:/alicetof/firmware/DRM2_rev2.0/DRM2_Zvtwelfth_fw/constraint/user.sdc
#   E:/alicetof/firmware/DRM2_rev2.0/DRM2_Zvtwelfth_fw/constraint/DRM2_top_derived_constraints.sdc
#   E:/alicetof/firmware/DRM2_rev2.0/DRM2_Zvtwelfth_fw/constraint/GBTXtest_main_compile.sdc
#   E:/alicetof/firmware/DRM2_rev2.0/DRM2_Zvtwelfth_fw/constraint/GBTXtest_main_synthesis.sdc
#

create_clock -name {FPGACK40} -period 25 -waveform {0 12.5 } -add  [ get_ports { FPGACK40_P } ]
create_clock -name {tx_clk0} -period 8 -waveform {0 4 } -add  [ get_nets { CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_0_TX_CLK } ]
create_clock -name {tx_clk2} -period 8 -waveform {0 4 } -add  [ get_nets { CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_2_TX_CLK } ]
create_clock -name {rx_clk0} -period 8 -waveform {0 4 } -add  [ get_nets { CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_0_RX_CLK } ]
create_clock -name {CLK_CONFIG_APB} -period 20 -waveform {0 10 } -add  [ get_nets { EPCS_Demo_INIT_APB_S_PCLK } ]
create_clock -name {DCLK0} -period 25 -waveform {0 12.5 } -add  [ get_ports { DCLK00_P } ]
create_clock -name {EPCS_Demo_instance/FABOSC_0/I_RCOSC_25_50MHZ/CLKOUT} -period 20 [ get_pins { EPCS_Demo_instance/FABOSC_0/I_RCOSC_25_50MHZ/CLKOUT } ]
create_clock -name {EPCS_Demo_instance/EPCS_Demo_sb_HPMS_0/CLK_CONFIG_APB} -period 200 [ get_pins { EPCS_Demo_instance/EPCS_Demo_sb_HPMS_0/MSS_ADLIB_INST/INST_MSS_075_IP/CLK_CONFIG_APB } ]
create_clock -name {CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_SERDES_IF_0/SERDESIF_INST/EPCS_RXCLK_0} -period 8 [ get_pins { CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_SERDES_IF_0/SERDESIF_INST/INST_SERDESIF_IP/EPCS_RXCLK_0 } ]
create_clock -name {CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_SERDES_IF_0/SERDESIF_INST/EPCS_TXCLK_0} -period 8 [ get_pins { CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_SERDES_IF_0/SERDESIF_INST/INST_SERDESIF_IP/EPCS_TXCLK_0 } ]
create_clock -name {CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_SERDES_IF_0/SERDESIF_INST/EPCS_RXCLK[0]} -period 8 [ get_pins { CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_SERDES_IF_0/SERDESIF_INST/INST_SERDESIF_IP/EPCS_RXCLK[0] } ]
create_clock -name {CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_SERDES_IF_0/SERDESIF_INST/EPCS_TXCLK[0]} -period 8 [ get_pins { CAEN_LINK_instance/I_EPCS_SERDES/EPCS_SERDES_IF_0/EPCS_SERDES_IF_0/SERDESIF_INST/INST_SERDESIF_IP/EPCS_TXCLK[0] } ]
create_generated_clock -name {EPCS_Demo_instance/CCC_0/GL0} -multiply_by 4 -divide_by 10 -source [ get_pins { EPCS_Demo_instance/CCC_0/CCC_INST/INST_CCC_IP/RCOSC_25_50MHZ } ] -phase 0 [ get_pins { EPCS_Demo_instance/CCC_0/CCC_INST/INST_CCC_IP/GL0 } ]
create_generated_clock -name {EPCS_Demo_instance/CCC_0/GL1} -multiply_by 4 -divide_by 5 -source [ get_pins { EPCS_Demo_instance/CCC_0/CCC_INST/INST_CCC_IP/RCOSC_25_50MHZ } ] -phase 0 [ get_pins { EPCS_Demo_instance/CCC_0/CCC_INST/INST_CCC_IP/GL1 } ]
set_input_delay 3 -min  -clock { DCLK0 } [ get_ports { DO_N } ]
set_input_delay 4 -max  -clock { DCLK0 } [ get_ports { DO_N } ]
set_input_delay 3 -min  -clock { DCLK0 } [ get_ports { DO_P } ]
set_input_delay 4 -max  -clock { DCLK0 } [ get_ports { DO_P } ]
set_input_delay 3 -min  -clock { DCLK0 } [ get_ports { GBTX_RXDVALID } ]
set_input_delay 4 -max  -clock { DCLK0 } [ get_ports { GBTX_RXDVALID } ]
set_input_delay 3 -min  -clock { DCLK0 } [ get_ports { GBTX_RXRDY } ]
set_input_delay 4 -max  -clock { DCLK0 } [ get_ports { GBTX_RXRDY } ]
set_input_delay 3 -min  -clock { DCLK0 } [ get_ports { GBTX_TXRDY } ]
set_input_delay 4 -max  -clock { DCLK0 } [ get_ports { GBTX_TXRDY } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { BERRB } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { BERRB } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { BUSYB } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { BUSYB } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { DTACKB } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { DTACKB } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { LTMLTB } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { LTMLTB } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { LWORDB } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { LWORDB } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { PXL_A } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { PXL_A } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { PXL_D } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { PXL_D } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { PXL_RD } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { PXL_RD } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { PXL_WR } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { PXL_WR } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { PXL_SDN } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { PXL_SDN } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { PXL_CS } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { PXL_CS } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { RAM_D } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { RAM_D } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { VAD } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { VAD } ]
set_input_delay 3 -min  -clock { FPGACK40 } [ get_ports { VDB } ]
set_input_delay 4 -max  -clock { FPGACK40 } [ get_ports { VDB } ]
set_output_delay 2 -min  -clock { DCLK0 } [ get_ports { DI_N } ]
set_output_delay 4 -max  -clock { DCLK0 } [ get_ports { DI_N } ]
set_output_delay 2 -min  -clock { DCLK0 } [ get_ports { DI_P } ]
set_output_delay 4 -max  -clock { DCLK0 } [ get_ports { DI_P } ]
set_output_delay 2 -min  -clock { DCLK0 } [ get_ports { GBTX_RESETB } ]
set_output_delay 3 -max  -clock { DCLK0 } [ get_ports { GBTX_RESETB } ]
set_output_delay 2 -min  -clock { FPGACK40 } [ get_ports { AML } ]
set_output_delay 4 -max  -clock { FPGACK40 } [ get_ports { AML } ]
set_output_delay 2 -min  -clock { FPGACK40 } [ get_ports { ASL } ]
set_output_delay 4 -max  -clock { FPGACK40 } [ get_ports { ASL } ]
set_false_path -from [ get_clocks { tx_clk0 } ] -to [ get_clocks { FPGACK40 } ]
set_false_path -from [ get_clocks { FPGACK40 } ] -to [ get_clocks { tx_clk0 } ]
set_false_path -from [ get_clocks { rx_clk0 } ] -to [ get_clocks { FPGACK40 } ]
set_false_path -from [ get_clocks { FPGACK40 } ] -to [ get_clocks { rx_clk0 } ]
set_false_path -through [ get_pins { EPCS_Demo_instance/CORECONFIGP_0/INIT_DONE_q1/D EPCS_Demo_instance/CORECONFIGP_0/SDIF_RELEASED_q1/D } ]
set_false_path -through [ get_nets { EPCS_Demo_instance/CORERESETP_0/ddr_settled EPCS_Demo_instance/CORERESETP_0/release_sdif*_core EPCS_Demo_instance/CORERESETP_0/count_sdif*_enable } ]
set_false_path -from [ get_cells { EPCS_Demo_instance/CORERESETP_0/MSS_HPMS_READY_int } ] -to [ get_cells { EPCS_Demo_instance/CORERESETP_0/sm0_areset_n_rcosc EPCS_Demo_instance/CORERESETP_0/sm0_areset_n_rcosc_q1 } ]
set_false_path -from [ get_cells { EPCS_Demo_instance/CORERESETP_0/MSS_HPMS_READY_int } ] -to [ get_cells { EPCS_Demo_instance/CORERESETP_0/sdif*_areset_n_rcosc* } ]
set_false_path -through [ get_pins { EPCS_Demo_instance/CORERESETP_0/CONFIG1_DONE_q1/D EPCS_Demo_instance/CORERESETP_0/CONFIG2_DONE_q1/D EPCS_Demo_instance/CORERESETP_0/SOFT_RESET_F2M_keep_RNIGH0B/A } ]
set_false_path -through [ get_pins { EPCS_Demo_instance/EPCS_Demo_sb_HPMS_0/MSS_ADLIB_INST/INST_MSS_075_IP/CONFIG_PRESET_N } ]
set_false_path -through [ get_nets { CAEN_LINK_instance/EPCS_SERDES_Lane0_RX_RESET_N } ]
set_false_path -through [ get_nets { CAEN_LINK_instance/EPCS_SERDES_Lane0_TX_RESET_N } ]
set_false_path -through { EPCS_Demo_instance/CORERESETP_0/INIT_DONE_int }
set_false_path -through { EPCS_Demo_instance/CORERESETP_0/SDIF_RELEASED_int }
set_max_delay 0 -through [ get_pins { EPCS_Demo_instance/CORECONFIGP_0/un1_fic_2_apb_m_psel/B EPCS_Demo_instance/CORECONFIGP_0/un1_fic_2_apb_m_psel/A EPCS_Demo_instance/CORECONFIGP_0/un6_int_psel_1/A } ] -to [ get_cells { EPCS_Demo_instance/CORECONFIGP_0/FIC_2_APB_M_PREADY* EPCS_Demo_instance/CORECONFIGP_0/state[0] } ]
set_min_delay -24 -through [ get_pins { EPCS_Demo_instance/CORECONFIGP_0/pwrite/D EPCS_Demo_instance/CORECONFIGP_0/un6_int_psel_1/C EPCS_Demo_instance/CORECONFIGP_0/paddr[6]/D EPCS_Demo_instance/CORECONFIGP_0/paddr[7]/D EPCS_Demo_instance/CORECONFIGP_0/paddr[10]/D EPCS_Demo_instance/CORECONFIGP_0/paddr[11]/D EPCS_Demo_instance/CORECONFIGP_0/paddr[12]/D EPCS_Demo_instance/CORECONFIGP_0/paddr[14]/D EPCS_Demo_instance/CORECONFIGP_0/paddr[13]/D EPCS_Demo_instance/CORECONFIGP_0/un4_0_iv[0]/A EPCS_Demo_instance/CORECONFIGP_0/un11_int_psel/C EPCS_Demo_instance/CORECONFIGP_0/prdata_m3_2[2]/B EPCS_Demo_instance/CORECONFIGP_0/prdata_m2s2/A EPCS_Demo_instance/CORECONFIGP_0/un4_0_iv[16]/B EPCS_Demo_instance/CORECONFIGP_0/prdata_m3_3[10]/B EPCS_Demo_instance/CORECONFIGP_0/paddr[2]/D EPCS_Demo_instance/CORECONFIGP_0/prdata_m3[17]/A EPCS_Demo_instance/CORECONFIGP_0/paddr[15]/D EPCS_Demo_instance/CORECONFIGP_0/paddr[9]/D EPCS_Demo_instance/CORECONFIGP_0/un4_0_iv[0]/D EPCS_Demo_instance/CORECONFIGP_0/un11_int_psel/B EPCS_Demo_instance/CORECONFIGP_0/prdata_m3[17]/B EPCS_Demo_instance/CORECONFIGP_0/prdata_m3_2[2]/C EPCS_Demo_instance/CORECONFIGP_0/prdata_m2s2/B EPCS_Demo_instance/CORECONFIGP_0/prdata_m2_1_0[0]/A EPCS_Demo_instance/CORECONFIGP_0/prdata_ss0/A EPCS_Demo_instance/CORECONFIGP_0/un4_0_iv[16]/C EPCS_Demo_instance/CORECONFIGP_0/prdata_m3_3[10]/A EPCS_Demo_instance/CORECONFIGP_0/paddr[3]/D EPCS_Demo_instance/CORECONFIGP_0/int_prdata57/A EPCS_Demo_instance/CORECONFIGP_0/paddr[5]/D EPCS_Demo_instance/CORECONFIGP_0/paddr[8]/D EPCS_Demo_instance/CORECONFIGP_0/un4_0_iv[0]/C EPCS_Demo_instance/CORECONFIGP_0/int_prdata57/B EPCS_Demo_instance/CORECONFIGP_0/prdata_m3_2[2]/A EPCS_Demo_instance/CORECONFIGP_0/prdata_m2s2/C EPCS_Demo_instance/CORECONFIGP_0/prdata_m2_1_0[0]/B EPCS_Demo_instance/CORECONFIGP_0/prdata_ss0/B EPCS_Demo_instance/CORECONFIGP_0/un4_0_iv[16]/A EPCS_Demo_instance/CORECONFIGP_0/prdata_m3_3[10]/C EPCS_Demo_instance/CORECONFIGP_0/paddr[4]/D EPCS_Demo_instance/CORECONFIGP_0/un11_int_psel/A EPCS_Demo_instance/CORECONFIGP_0/pwdata[30]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[31]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[17]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[18]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[21]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[22]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[23]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[24]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[26]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[29]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[7]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[7]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[8]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[8]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[9]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[9]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[11]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[11]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[12]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[12]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[13]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[13]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[15]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[15]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[2]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[2]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[3]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[3]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[5]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[5]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[28]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[16]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[16]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[6]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[6]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[14]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[14]/D EPCS_Demo_instance/CORECONFIGP_0/control_reg_1[1]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[1]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[1]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[10]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[10]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[25]/D EPCS_Demo_instance/CORECONFIGP_0/control_reg_1[0]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[0]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[0]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[27]/D EPCS_Demo_instance/CORECONFIGP_0/soft_reset_reg[4]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[4]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[20]/D EPCS_Demo_instance/CORECONFIGP_0/pwdata[19]/D EPCS_Demo_instance/CORECONFIGP_0/un1_fic_2_apb_m_psel/B EPCS_Demo_instance/CORECONFIGP_0/un1_fic_2_apb_m_psel/A EPCS_Demo_instance/CORECONFIGP_0/un6_int_psel_1/A } ]
set_clock_groups -name {default_clkgrp_0} -asynchronous -group [ get_clocks { tx_clk0 } ] -group [ get_clocks { FPGACK40 } ]
set_clock_groups -name {default_clkgrp_1} -asynchronous -group [ get_clocks { FPGACK40 } ] -group [ get_clocks { tx_clk0 } ]
set_clock_groups -name {default_clkgrp_2} -asynchronous -group [ get_clocks { rx_clk0 } ] -group [ get_clocks { FPGACK40 } ]
set_clock_groups -name {default_clkgrp_3} -asynchronous -group [ get_clocks { rx_clk0 } ] -group [ get_clocks { tx_clk0 } ]
set_clock_groups -name {default_clkgrp_4} -asynchronous -group [ get_clocks { FPGACK40 } ] -group [ get_clocks { DCLK0 } ]
