# Top Level Design Parameters

# Clocks

create_clock -period 25.000000 -waveform {0.000000 12.500000} CLK
create_clock -period 25.000000 -waveform {0.000000 12.500000} U_ROC32/PLL_tdc_del/Core:GLB
create_clock -period 12.500000 -waveform {0.000000 6.250000} U_ROC32/PLL_sram_del/Core:GLB
create_clock -period 100.000000 -waveform {0.000000 50.000000} MWOK
create_clock -period 100.000000 -waveform {0.000000 50.000000} MROK
create_clock -period 100.000000 -waveform {0.000000 50.000000} ASB

# False Paths Between Clocks


# False Path Constraints

set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[18]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[19]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[20]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[21]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[22]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[23]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[24]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[25]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[26]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[27]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[28]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[29]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[30]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/PIPE1_DT[31]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/NWPIPE1:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/END_EVNT1:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[0]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[1]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[2]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[3]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[4]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[5]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[6]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG1[7]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[0]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[1]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[2]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[3]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[4]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[5]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[6]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG2[7]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[0]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[1]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[2]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[3]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[4]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[5]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[6]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[0]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[1]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[2]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[3]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[4]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[5]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[6]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[7]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[8]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[9]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[10]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[11]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[12]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[13]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[14]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[15]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[16]:D}
set_false_path -from {U_ROC32/MIC_REG3[7]:CLK} -to {U_ROC32/RAMAD1[17]:D}
set_false_path -from {U_VINTERF/CONTROL1[0]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL1[1]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL1[2]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL1[3]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL1[4]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL1[5]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL1[6]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL1[7]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL2[0]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL2[1]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL2[2]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL2[3]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL2[4]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL2[5]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL2[6]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL2[7]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL3[0]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL3[1]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL3[2]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL3[3]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL3[4]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL3[5]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL3[6]:CLK} -to {*}
set_false_path -from {U_VINTERF/CONTROL3[7]:CLK} -to {*}

# Maximum Delay Constraints


# Multicycle Constraints


# Virtual Clocks
# Output Load Constraints
# Driving Cell Constraints
# Wire Loads
# set_wire_load_mode top

# Other Constraints
set_output_delay 16.000 -clock {CLK} {ADE[0]}
set_output_delay 16.000 -clock {CLK} {ADE[1]}
set_output_delay 16.000 -clock {CLK} {ADE[2]}
set_output_delay 16.000 -clock {CLK} {ADE[3]}
set_output_delay 16.000 -clock {CLK} {ADE[4]}
set_output_delay 16.000 -clock {CLK} {ADE[5]}
set_output_delay 16.000 -clock {CLK} {ADE[6]}
set_output_delay 16.000 -clock {CLK} {ADE[7]}
set_output_delay 16.000 -clock {CLK} {ADE[8]}
set_output_delay 16.000 -clock {CLK} {ADE[9]}
set_output_delay 16.000 -clock {CLK} {ADE[10]}
set_output_delay 16.000 -clock {CLK} {ADE[11]}
set_output_delay 16.000 -clock {CLK} {ADE[12]}
set_output_delay 16.000 -clock {CLK} {ADE[13]}
set_output_delay 16.000 -clock {CLK} {ADE[14]}
set_output_delay 16.000 -clock {CLK} {ADE[15]}
set_output_delay 16.000 -clock {CLK} {ADO[0]}
set_output_delay 16.000 -clock {CLK} {ADO[1]}
set_output_delay 16.000 -clock {CLK} {ADO[2]}
set_output_delay 16.000 -clock {CLK} {ADO[3]}
set_output_delay 16.000 -clock {CLK} {ADO[4]}
set_output_delay 16.000 -clock {CLK} {ADO[5]}
set_output_delay 16.000 -clock {CLK} {ADO[6]}
set_output_delay 16.000 -clock {CLK} {ADO[7]}
set_output_delay 16.000 -clock {CLK} {ADO[8]}
set_output_delay 16.000 -clock {CLK} {ADO[9]}
set_output_delay 16.000 -clock {CLK} {ADO[10]}
set_output_delay 16.000 -clock {CLK} {ADO[11]}
set_output_delay 16.000 -clock {CLK} {ADO[12]}
set_output_delay 16.000 -clock {CLK} {ADO[13]}
set_output_delay 16.000 -clock {CLK} {ADO[14]}
set_output_delay 16.000 -clock {CLK} {ADO[15]}
set_output_delay 11.000 -clock {CLK} {NOESRAME}
set_output_delay 11.000 -clock {CLK} {NOESRAMO}
set_output_delay 7.000 -clock {CLK_sram} -clock_fall {NWRSRAME}
set_output_delay 7.000 -clock {CLK_sram} -clock_fall {NWRSRAMO}
set_output_delay 6.000 -clock {CLK} {DTE[0]}
set_input_delay 20.000 -clock {CLK} {DTE[0]}
set_output_delay 6.000 -clock {CLK} {DTE[1]}
set_input_delay 20.000 -clock {CLK} {DTE[1]}
set_output_delay 6.000 -clock {CLK} {DTE[2]}
set_input_delay 20.000 -clock {CLK} {DTE[2]}
set_output_delay 6.000 -clock {CLK} {DTE[3]}
set_input_delay 20.000 -clock {CLK} {DTE[3]}
set_output_delay 6.000 -clock {CLK} {DTE[4]}
set_input_delay 20.000 -clock {CLK} {DTE[4]}
set_output_delay 6.000 -clock {CLK} {DTE[5]}
set_input_delay 20.000 -clock {CLK} {DTE[5]}
set_output_delay 6.000 -clock {CLK} {DTE[6]}
set_input_delay 20.000 -clock {CLK} {DTE[6]}
set_output_delay 6.000 -clock {CLK} {DTE[7]}
set_input_delay 20.000 -clock {CLK} {DTE[7]}
set_output_delay 6.000 -clock {CLK} {DTE[8]}
set_input_delay 20.000 -clock {CLK} {DTE[8]}
set_output_delay 6.000 -clock {CLK} {DTE[9]}
set_input_delay 20.000 -clock {CLK} {DTE[9]}
set_output_delay 6.000 -clock {CLK} {DTE[10]}
set_input_delay 20.000 -clock {CLK} {DTE[10]}
set_output_delay 6.000 -clock {CLK} {DTE[11]}
set_input_delay 20.000 -clock {CLK} {DTE[11]}
set_output_delay 6.000 -clock {CLK} {DTE[12]}
set_input_delay 20.000 -clock {CLK} {DTE[12]}
set_output_delay 6.000 -clock {CLK} {DTE[13]}
set_input_delay 20.000 -clock {CLK} {DTE[13]}
set_output_delay 6.000 -clock {CLK} {DTE[14]}
set_input_delay 20.000 -clock {CLK} {DTE[14]}
set_output_delay 6.000 -clock {CLK} {DTE[15]}
set_input_delay 20.000 -clock {CLK} {DTE[15]}
set_output_delay 6.000 -clock {CLK} {DTE[16]}
set_input_delay 20.000 -clock {CLK} {DTE[16]}
set_output_delay 6.000 -clock {CLK} {DTE[17]}
set_input_delay 20.000 -clock {CLK} {DTE[17]}
set_output_delay 6.000 -clock {CLK} {DTE[18]}
set_input_delay 20.000 -clock {CLK} {DTE[18]}
set_output_delay 6.000 -clock {CLK} {DTE[19]}
set_input_delay 20.000 -clock {CLK} {DTE[19]}
set_output_delay 6.000 -clock {CLK} {DTE[20]}
set_input_delay 20.000 -clock {CLK} {DTE[20]}
set_output_delay 6.000 -clock {CLK} {DTE[21]}
set_input_delay 20.000 -clock {CLK} {DTE[21]}
set_output_delay 6.000 -clock {CLK} {DTE[22]}
set_input_delay 20.000 -clock {CLK} {DTE[22]}
set_output_delay 6.000 -clock {CLK} {DTE[23]}
set_input_delay 20.000 -clock {CLK} {DTE[23]}
set_output_delay 6.000 -clock {CLK} {DTE[24]}
set_input_delay 20.000 -clock {CLK} {DTE[24]}
set_output_delay 6.000 -clock {CLK} {DTE[25]}
set_input_delay 20.000 -clock {CLK} {DTE[25]}
set_output_delay 6.000 -clock {CLK} {DTE[26]}
set_input_delay 20.000 -clock {CLK} {DTE[26]}
set_output_delay 6.000 -clock {CLK} {DTE[27]}
set_input_delay 20.000 -clock {CLK} {DTE[27]}
set_output_delay 6.000 -clock {CLK} {DTE[28]}
set_input_delay 20.000 -clock {CLK} {DTE[28]}
set_output_delay 6.000 -clock {CLK} {DTE[29]}
set_input_delay 20.000 -clock {CLK} {DTE[29]}
set_output_delay 6.000 -clock {CLK} {DTE[30]}
set_input_delay 20.000 -clock {CLK} {DTE[30]}
set_output_delay 6.000 -clock {CLK} {DTE[31]}
set_input_delay 20.000 -clock {CLK} {DTE[31]}
set_output_delay 6.000 -clock {CLK} {DTO[0]}
set_input_delay 20.000 -clock {CLK} {DTO[0]}
set_output_delay 6.000 -clock {CLK} {DTO[1]}
set_input_delay 20.000 -clock {CLK} {DTO[1]}
set_output_delay 6.000 -clock {CLK} {DTO[2]}
set_input_delay 20.000 -clock {CLK} {DTO[2]}
set_output_delay 6.000 -clock {CLK} {DTO[3]}
set_input_delay 20.000 -clock {CLK} {DTO[3]}
set_output_delay 6.000 -clock {CLK} {DTO[4]}
set_input_delay 20.000 -clock {CLK} {DTO[4]}
set_output_delay 6.000 -clock {CLK} {DTO[5]}
set_input_delay 20.000 -clock {CLK} {DTO[5]}
set_output_delay 6.000 -clock {CLK} {DTO[6]}
set_input_delay 20.000 -clock {CLK} {DTO[6]}
set_output_delay 6.000 -clock {CLK} {DTO[7]}
set_input_delay 20.000 -clock {CLK} {DTO[7]}
set_output_delay 6.000 -clock {CLK} {DTO[8]}
set_input_delay 20.000 -clock {CLK} {DTO[8]}
set_output_delay 6.000 -clock {CLK} {DTO[9]}
set_input_delay 20.000 -clock {CLK} {DTO[9]}
set_output_delay 6.000 -clock {CLK} {DTO[10]}
set_input_delay 20.000 -clock {CLK} {DTO[10]}
set_output_delay 6.000 -clock {CLK} {DTO[11]}
set_input_delay 20.000 -clock {CLK} {DTO[11]}
set_output_delay 6.000 -clock {CLK} {DTO[12]}
set_input_delay 20.000 -clock {CLK} {DTO[12]}
set_output_delay 6.000 -clock {CLK} {DTO[13]}
set_input_delay 20.000 -clock {CLK} {DTO[13]}
set_output_delay 6.000 -clock {CLK} {DTO[14]}
set_input_delay 20.000 -clock {CLK} {DTO[14]}
set_output_delay 6.000 -clock {CLK} {DTO[15]}
set_input_delay 20.000 -clock {CLK} {DTO[15]}
set_output_delay 6.000 -clock {CLK} {DTO[16]}
set_input_delay 20.000 -clock {CLK} {DTO[16]}
set_output_delay 6.000 -clock {CLK} {DTO[17]}
set_input_delay 20.000 -clock {CLK} {DTO[17]}
set_output_delay 6.000 -clock {CLK} {DTO[18]}
set_input_delay 20.000 -clock {CLK} {DTO[18]}
set_output_delay 6.000 -clock {CLK} {DTO[19]}
set_input_delay 20.000 -clock {CLK} {DTO[19]}
set_output_delay 6.000 -clock {CLK} {DTO[20]}
set_input_delay 20.000 -clock {CLK} {DTO[20]}
set_output_delay 6.000 -clock {CLK} {DTO[21]}
set_input_delay 20.000 -clock {CLK} {DTO[21]}
set_output_delay 6.000 -clock {CLK} {DTO[22]}
set_input_delay 20.000 -clock {CLK} {DTO[22]}
set_output_delay 6.000 -clock {CLK} {DTO[23]}
set_input_delay 20.000 -clock {CLK} {DTO[23]}
set_output_delay 6.000 -clock {CLK} {DTO[24]}
set_input_delay 20.000 -clock {CLK} {DTO[24]}
set_output_delay 6.000 -clock {CLK} {DTO[25]}
set_input_delay 20.000 -clock {CLK} {DTO[25]}
set_output_delay 6.000 -clock {CLK} {DTO[26]}
set_input_delay 20.000 -clock {CLK} {DTO[26]}
set_output_delay 6.000 -clock {CLK} {DTO[27]}
set_input_delay 20.000 -clock {CLK} {DTO[27]}
set_output_delay 6.000 -clock {CLK} {DTO[28]}
set_input_delay 20.000 -clock {CLK} {DTO[28]}
set_output_delay 6.000 -clock {CLK} {DTO[29]}
set_input_delay 20.000 -clock {CLK} {DTO[29]}
set_output_delay 6.000 -clock {CLK} {DTO[30]}
set_input_delay 20.000 -clock {CLK} {DTO[30]}
set_output_delay 6.000 -clock {CLK} {DTO[31]}
set_input_delay 20.000 -clock {CLK} {DTO[31]}
